<?php

namespace Database\Seeders;

use App\Models\Article;
use App\Models\Home;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class HomeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Home::Create([
            'page' => 'الرئيسية',
            'main_title' => 'ساهم، لنغذي الحاجة والأمل',
            'sub_title' => 'طعامك الفائض قد يعني الكثير لآخرين',
            'our_role' => 'تسعى منصة "ساهم" إلى الحد من هدر الطعام ودعم المحتاجين، من خلال توفير وسيلة لربط المؤسسات الخيرية بالمطاعم والمتاجر التي تمتلك طعامًا فائضًا، مما يتيح فرصة استغلال هذا الفائض وتوجيهه للمحتاجين بدلاً من التخلص منه، فتأتي منصة "ساهم" كوسيلة للتعاون والتكامل بين مختلف الجهات لتقديم الدعم والإغاثة لأولئك الذين في حاجة ماسة إلى الطعام.',
            'step_1_title' => '
يقوم ممثل المطعم أو المتجر بوضع تبرع في المنصة',
            'step_1_description' => 'عندما يقرر ممثل المطعم أو المتجر التبرع بالطعام الفائض، يقوم بالدخول إلى منصة "ساهم" ويسجل التبرع بوصف مفصل للطعام المتاح للتبرع. يقدم المعلومات الضرورية مثل نوع الطعام، كمية الفائض، وتفاصيل الاتصال.',
            'step_2_title' => 'يقوم ممثل المؤسسة الخيرية بتصفح التبرعات و تقديم الطلب',
            'step_2_description' => 'بمجرد أن يتم وضع التبرع على المنصة، يقوم ممثل المؤسسة الخيرية بتصفح التبرعات المتاحة عبر الصفحة والبحث عن الطعام الذي يناسب احتياجات المحتاجين الذين يخدمونهم. يمكنهم طلب الكميات المحددة والاتصال بممثل المتجر أو المطعم لترتيب استلام الطعام.',
            'step_3_title' => 'يقبل المتبرع الطلب و يقوم بتسليمه للمؤسسة الخيرية',
            'step_3_description' => 'عندما يتم تقديم طلب من ممثل المؤسسة الخيرية، يقوم المتبرع بالتأكيد على الطلب ويقبله. يتم ترتيب توصيل الطعام أو تحديد مكان الاستلام بين المتبرع والمؤسسة الخيرية. المتبرع يعمل على تسليم الطعام بطريقة تضمن سلامته وجودته، ليتمكن المستفيدون النهائيون من الاستفادة منه بشكل أفضل.',
            'step_4_title' => '
تقوم المؤسسة بتوزيع التبرعات على المحتاجين',
            'step_4_description' => 'بمجرد استلام الطعام من المتبرع، تقوم المؤسسة الخيرية بتنظيم وتوزيع الطعام على المحتاجين. يتم التعامل بحرفية لضمان توزيع الطعام بشكل عادل وفقًا للاحتياجات الملحة، ويمكن أن يشمل ذلك التوزيع عبر مطابخ خيرية أو توصيل الطعام مباشرةً للعائلات أو الأفراد الذين يحتاجون إليه بشكل مباشر.',
            'page_image' => 'pages_images/home.png'
        ]);
        // /////////////////////////////
        Home::Create([
            'page' => 'تواصل معنا',
            'contact_us_location' => 'الرياض -حي الملقا - انس مالك',
            'contact_us_email'=> 'contact@sahem.com',
            'contact_us_phone'=> '+966505152703',
            'page_image' => 'pages_images/contact_us.png'
        ]);
        // /////////////////////////////
        Home::Create([
            'page' => 'من نحن',
            'about_us_body'=> ' نحن مجموعة من الشباب الملتزمين بقيم المسؤولية الاجتماعية، ندير منصة ساهم رؤية تطوعية وأهداف غير ربحية. يدفعنا الحماس والرغبة في تحسين المجتمع من خلال استثمار طاقاتنا ومهاراتنا في جمع الطعام الفائض وتوجيهه إلى من يحتاجون إليه. نعتبر أن العمل التطوعي والتعاون مع المطاعم والمتاجر والمؤسسات الخيرية هو مفتاح للمساهمة في إحداث تغيير إيجابي في حياة الأفراد وتعزيز الرفاهية الاجتماعية طالبات المشروع : ريوف, مها, حنين, ديما عبد الرحمن,ديما فهد .',
            'about_Q_1'=> "كيف يمكن للمطاعم والمتاجر المشاركة في منصة 'ساهم'؟",
            'about_A_1'=> 'يمكن للمطاعم والمتاجر التبرع بالطعام الفائض من خلال التسجيل في المنصة ووضع التبرعات المتاحة بوصف مفصل للطعام وكميته وتفاصيل الاتصال.',
            'about_Q_2'=> 'هل يتم توفير تقنيات خاصة لجمع وتوزيع الطعام؟',
            'about_A_2'=> 'نحن نقدم منصة تواصل بين المطاعم والمتاجر الذين يودون التبرع بالطعام والمؤسسات الخيرية التي تحتاج إليه. ليست هناك تقنيات محددة للجمع أو التوزيع.',
            'about_Q_3'=> 'هل يمكن للأفراد المشاركة في جمع الطعام؟',
            'about_A_3'=> 'في الوقت الحالي، المنصة موجهة للمطاعم والمتاجر والمؤسسات الخيرية. ومع ذلك، يمكن للأفراد دعم المبادرة عبر المشاركة في نشر الوعي حولها ودعم الأماكن التي تشارك في التبرع.',
            'about_Q_4'=> 'هل هناك متطلبات معينة للمطاعم أو المتاجر للتبرع؟',
            'about_A_4'=> 'يمكن لأي مطعم أو متجر يمتلك طعامًا فائضًا أن يتبرع. الأمور الأساسية تشمل وصف الطعام وكميته وتوفير تفاصيل الاتصال.',
            'about_Q_5'=> 'كيف تتم عملية التحقق من جودة الطعام المتبرع؟',
            'about_A_5'=> 'نحن نشجع المتبرعين على تقديم طعام ذي جودة عالية ويتم عادةً التحقق من الجودة من خلال التواصل المباشر والمعاينة عند استلام الطعام.',
            'about_Q_6'=> 'هل تحصل المنصة على عمولة من عمليات التبرع أو التوزيع؟',
            'about_A_6'=> 'لا، نحن منصة غير ربحية ولا نأخذ عمولات من عمليات التبرع أو التوزيع.',
            'about_Q_7'=> 'هل يمكن للمؤسسات الخيرية تحديد مواعيد لاستلام الطعام؟',
            'about_A_7'=> 'نعم، يمكن للمؤسسات الخيرية التفاوض مع المتبرعين بشأن مواعيد استلام الطعام وترتيب ذلك وفقًا لاحتياجاتهم وجدولهم.',
            'about_Q_8'=> 'هل يتم توثيق عمليات التبرع والتوزيع؟',
            'about_A_8'=> 'نعم، يتم توثيق التبرعات والتوزيعات من خلال سجلات مفصلة لضمان شفافية ودقة في عمليات الإعطاء والاستلام.',
            'about_Q_9'=> 'كيف يمكن الاتصال بفريق منصة "ساهم" للمزيد من المعلومات؟',
            'about_A_9'=> 'يمكنكم التواصل معنا عبر البريد الإلكتروني [البريد الإلكتروني] أو من خلال صفحتنا على الشبكات الاجتماعية للحصول على أي استفسارات أو معلومات إضافية.',
            'about_Q_10'=>'',
            'about_A_10'=>'',
            'page_image' => 'pages_images/about_us.png'
        ]);
    }
}
